In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# 使用python内建的sqlite3驱动创建一个SQLite数据库
import sqlite3

query = 'CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);'
con = sqlite3.connect('data/mydata.sqlite')
con.execute(query)
con.commit()

In [3]:
# 插入几行数据
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [4]:
# 从数据库读取数据
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [5]:
cursor.description  # 游标的description中含有列名

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [6]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])  # 将元祖的列表转为DataFrame

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [7]:
# SQLAlchemy项目是一个流行的Python SQL工具，它抽象出了SQL数据库中的许多常见差异。
# pandas有一个read_sql函数，可以让你轻松的从SQLAlchemy连接读取数据。
# 这里，我们用SQLAlchemy连接SQLite数据库，并从之前创建的表读取数据

# pip install sqlalchemy
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///data/mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [8]:
import os
os.remove('data/mydata.sqlite')